# -*- coding: utf-8 -*-
"""
학교명 마스킹을 위한 학교 리스트
이 파일은 학교명 탐지 및 마스킹에 사용됩니다.
"""

school_list = [
    # 초등학교
    "영훈초","유석초","경복초","성동초","세종초","동광초",
    "상명초","청원초","태강삼육초","삼육초","화랑초",
    "동북초","한신초","경희초","서울삼육초","은석초",
    "중앙부초","중대부초","홍익부초","홍대부초","경기초",
    "명지초","이화부초","이대부초","추계초","계성초",
    "한양초","광운초","대광초","매원초","성신초","우촌초",
    "신광초","선일초","예일초","충암초","상명부초","상대부초",
    "운현초","동산초","리라초","숭의초","금성초",
    "동화초","태랑초","서교초","도림초","이대부초",

    # 중학교
    "국제중","예중","여중",
    "양정중","경희중","휘문중","세화중","신사중","신동중",
    "중앙중","중동중",
    "문원중","과천중","귀인중","석호중","해양중","시곡중",
    "대안중","신일중",
    "신정중","용유중","예송중","공항중","박문중","해송중",
    "중산중","능허대중","신송중","영종중",
    "동화중","태랑중","성산중","여의도중",
    "이대부중","대현중","윤중중","용산여중",

    # 고등학교
    "서울과고","과고","외고","하나고","민사고","외대부고",
    "경신고","낙생고","선덕고","보인고","세화고","양서고",
    "단대부고","회성고","중동고","삼성고","운정고","상산고",
    "배재고","중산고","상문고","강서고","세화여고","동화고",
    "진선여고", "중일고","영신여고",
    "홍대부고","홍익여고","여의도여고","여의도고",
    "이대부고","선유고","아현고","대현고","용산고",
    "윤중여고","용산여고","영신고","영등포여고","영등포고",
    "서라벌고","경기여고","과학고","관광고",

    # 대학교
    "서울대","연세대","이화여대","이대","고려대","연대","고대",
    "성균관대","성대","서강대","한양대","중앙대","서울시립대",
    "시립대","경희대","한국외대","외대","동국대","건국대","동대",
    "건대","홍익대","홍대","부산대","아주대","경북대","인하대",
    "한국항공대","항공대","서울과학기술대","과기대",
    "숭실대","숙명여대","국민대","광운대","세종대","전남대",
    "한국기술교육대","한국기술대","기술교육대","한기대",
    "단국대","충남대","한국공학대","한국공대","공대",
    "가천대","명지대","성신여대","인천대","충북대","가톨릭대",
    "경기대","부경대","전북대","한성대","상명대","서울여대",
    "동덕여대","강원대","경상대","덕성여대","수원대",
    "제주대","서경대","삼육대","GIST","UNIST","KAIST",
    "지스트","유니스트","카이스트","꽃동네대","백석대",
    "백석예대","서일대","서울예대",
    "한예종","국제예술대","국제예대","신한대","고구려대",
    "한남대","한밭대",

    # 특수학교
    "맹학교","솔빛학교"
]